In [1]:
import mysql.connector
from mysql.connector import Error

def create_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

connection = create_connection("localhost", "root", "")

Connection to MySQL DB successful

In [7]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [8]:
show_db_query = "SHOW DATABASES"
with connection.cursor() as cursor:
     cursor.execute(show_db_query)
     for db in cursor:
         print(db)

('hellow',)
('information_schema',)
('login',)
('mysql',)
('namiroh',)
('performance_schema',)
('phpmyadmin',)
('sales',)
('test',)

In [19]:
create_database_query = "CREATE DATABASE online_movie_rating"
create_database(connection, create_database_query)

Database created successfully

In [35]:
def create_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database="online_movie_rating"
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

connection = create_connection("localhost", "root", "")

Connection to MySQL DB successful

In [36]:
show_table_query = "DESCRIBE movies"
with connection.cursor() as cursor:
     cursor.execute(show_table_query)
     # Fetch rows from last executed query
     result = cursor.fetchall()
     for row in result:
        print(row)

('id', 'int(11)', 'NO', 'PRI', None, '')
('title', 'varchar(100)', 'NO', '', None, '')
('release_year', 'year(4)', 'NO', '', None, '')
('genre', 'varchar(100)', 'NO', '', None, '')
('collection_in_mil', 'int(11)', 'NO', '', None, '')

In [40]:
insert_movies_query = """
INSERT INTO movies (id,title, release_year, genre, collection_in_mil)
VALUES
    (1,"Forrest Gump", 1994, "Drama", 330.2),
    (2,"3 Idiots", 2009, "Drama", 2.4),
    (3,"Eternal Sunshine of the Spotless Mind", 2004, "Drama", 34.5),
    (4,"Good Will Hunting", 1997, "Drama", 138.1),
    (5,"Skyfall", 2012, "Action", 304.6),
    (6,"Gladiator", 2000, "Action", 188.7),
    (7,"Black", 2005, "Drama", 3.0),
    (8,"Titanic", 1997, "Romance", 659.2),
    (9,"The Shawshank Redemption", 1994, "Drama",28.4),
    (10,"Udaan", 2010, "Drama", 1.5),
    (11,"Home Alone", 1990, "Comedy", 286.9),
    (12,"Casablanca", 1942, "Romance", 1.0),
    (13,"Avengers: Endgame", 2019, "Action", 858.8),
    (14,"Night of the Living Dead", 1968, "Horror", 2.5),
    (15,"The Godfather", 1972, "Crime", 135.6);
"""
execute_query(connection, insert_movies_query)

Query executed successfully

In [47]:
insert_reviewers_query = """
INSERT INTO reviewers (id,first_name,last_name)
VALUES
    (1,"Chaitanya", "Baweja"),
    (2,"Mary", "Cooper"),
    (3,"John", "Wayne"),
    (4,"Thomas", "Stoneman"),
    (5,"Penny", "Hofstadter"),
    (6,"Mitchell", "Marsh"),
    (7,"Wyatt", "Skaggs"),
    (8,"Andre", "Veiga"),
    (9,"Sheldon", "Cooper"),
    (10,"Kimbra", "Masters"),
    (11,"Kat", "Dennings"),
    (12,"Bruce", "Wayne"),
    (13,"Domingo", "Cortes"),
    (14,"Rajesh", "Koothrappali"),
    (15,"Ben", "Glocker");
"""
execute_query(connection, insert_reviewers_query)

Query executed successfully

In [50]:
insert_ratings_query = """
INSERT INTO ratings (rating,movie_id,reviewer_id)
VALUES
    (8.1,1,15),
    (7.5,2,14),
    (8.2,3,13),
    (6,4,12),
    (5.7,5,11),
    (7.3,6,10),
    (7,7,9),
    (8.1,8,8),
    (9.5,9,7),
    (6.5,10,6),
    (6,11,5),
    (8.9,12,4),
    (8.8,13,3),
    (7.2,14,2),
    (5.5,15,1);
"""
execute_query(connection, insert_ratings_query)

Query executed successfully

In [51]:
select_movies_query = "SELECT * FROM movies LIMIT 5"
with connection.cursor() as cursor:
     cursor.execute(select_movies_query)
     result = cursor.fetchall()
     for row in result:
         print(row)

(1, 'Forrest Gump', 1994, 'Drama', 330)
(2, '3 Idiots', 2009, 'Drama', 2)
(3, 'Eternal Sunshine of the Spotless Mind', 2004, 'Drama', 35)
(4, 'Good Will Hunting', 1997, 'Drama', 138)
(5, 'Skyfall', 2012, 'Action', 305)

In [52]:
select_movies_query = "SELECT title, release_year FROM movies LIMIT 5"
with connection.cursor() as cursor:
     cursor.execute(select_movies_query)
     for row in cursor.fetchall():
         print(row)

('Forrest Gump', 1994)
('3 Idiots', 2009)
('Eternal Sunshine of the Spotless Mind', 2004)
('Good Will Hunting', 1997)
('Skyfall', 2012)

In [53]:
select_movies_query = """
 SELECT title, collection_in_mil
 FROM movies
 WHERE collection_in_mil > 300
 ORDER BY collection_in_mil DESC
 """
with connection.cursor() as cursor:
     cursor.execute(select_movies_query)
     for movie in cursor.fetchall():
         print(movie)

('Avengers: Endgame', 859)
('Titanic', 659)
('Forrest Gump', 330)
('Skyfall', 305)

In [54]:
select_movies_query = """
 SELECT title, AVG(rating) as average_rating
 FROM ratings
 INNER JOIN movies
 ON movies.id = ratings.movie_id
 GROUP BY movie_id
 ORDER BY average_rating DESC
 LIMIT 5
 """
with connection.cursor() as cursor:
     cursor.execute(select_movies_query)
     for movie in cursor.fetchall():
         print(movie)

('The Shawshank Redemption', Decimal('10.0000'))
('Avengers: Endgame', Decimal('9.0000'))
('Casablanca', Decimal('9.0000'))
('Titanic', Decimal('8.0000'))
('3 Idiots', Decimal('8.0000'))

In [55]:
update_query = """
UPDATE
    reviewers
SET
    last_name = "Coolesh"
WHERE
    first_name = "Mary"
"""
execute_query(connection, update_query)

Query executed successfully

In [56]:
select_query = """
 SELECT first_name, last_name
 FROM reviewers
 """
with connection.cursor() as cursor:
     cursor.execute(select_query)
     for reviewer in cursor.fetchall():
         print(reviewer)

('Chaitanya', 'Baweja')
('Mary', 'Coolesh')
('John', 'Wayne')
('Thomas', 'Stoneman')
('Penny', 'Hofstadter')
('Mitchell', 'Marsh')
('Wyatt', 'Skaggs')
('Andre', 'Veiga')
('Sheldon', 'Cooper')
('Kimbra', 'Masters')
('Kat', 'Dennings')
('Bruce', 'Wayne')
('Domingo', 'Cortes')
('Rajesh', 'Koothrappali')
('Ben', 'Glocker')